import time

பயனாகும்கோப்பு1 = 'test.txt'
மூலக்கோப்பு = open(பயனாகும்கோப்பு1, 'r')
மூலக்கோப்புத்தரவுப்பட்டி = மூலக்கோப்பு.readlines() 
#மூலக்கோப்புத்தரவு1 = str(மூலக்கோப்புத்தரவு1).split()
#print(மூலக்கோப்புத்தரவுப்பட்டி)
#print(type(மூலக்கோப்புத்தரவுப்பட்டி))
வரியெண் = 0
for வரி in மூலக்கோப்புத்தரவுப்பட்டி:
	வரிமுன்பின்வெற்றிடம் = வரி.strip()
	#வெற்றுவரியைக் கணக்கிட, எடுத்துக் கொண்ட வரியில் உள்ள எழுத்துக்களைக் கூட்டி அறிகிறேன். வெற்றுவரியில் ஒரு எழுத்தும் இருக்காது அல்லவா!
	வரியெழுத்தெண்ணிக்கை = len(வரிமுன்பின்வெற்றிடம்)
	#print(வரியெழுத்தெண்ணிக்கை)
	#print(type(வரியெழுத்தெண்ணிக்கை))
	வரியெண் = 0
	if not வரியெழுத்தெண்ணிக்கை == 0:
		if 'பாடல்' in வரி:
			பாடலெண் = வரி.split('-')[-1]
			பாடலெண்சரம் = 'பாடல்' +  str(பாடலெண்).strip() + '-'
			#print(பாடலெண்சரம்)
			time.sleep(1)
		if not 'பாடல்' in வரி:
			வரியெண் = வரியெண்+1
			#  வரிசையெண் (integer) என்பதால் அதனை சரமாக (string) மாற்றுகிறேன்
			வரியெண்வடிவம் = 'வரி' + str(வரியெண்) + '- '
			வரியெண்ணுடன்வரி = வரியெண்வடிவம் + வரிமுன்பின்வெற்றிடம்
			பாடலெண்வரியெண்வரி = பாடலெண்சரம் + வரியெண்ணுடன்வரி
			#print(பாடலெண்வரியெண்வரி)
			வரிசொற்கள்பிரி = பாடலெண்வரியெண்வரி.split()
			பாடலெண்வரியெண் = வரிசொற்கள்பிரி[0]
			பாடலெண்வரியெண்மீதி = வரிசொற்கள்பிரி[1:]
			#print(வரிசொற்கள்பிரி)
			#print(பாடலெண்வரியெண்)
			#print(type(பாடலெண்வரியெண்))
			#print(பாடலெண்வரியெண்மீதி)
			#print(type(பாடலெண்வரியெண்மீதி))
			# பாடலெண்வரியெண்மீதி என்பது பட்டியாக(list) இருப்பதால் for loop பயன்படுத்தி ஒவ்வொன்றாக எடுக்கிறேன்.
			சொல்லெண் = 0
			for பாடற்ச்சொல் in பாடலெண்வரியெண்மீதி: 
				சொல்லெண் = சொல்லெண்+1
				சொல்லெண்சரம் = 'சொல்' + str(சொல்லெண்)
				#இறுதிவடிவம் = பாடற்ச்சொல் + ' (' + பாடலெண்வரியெண் + சொல்லெண்சரம் + ')'
				இறுதிவடிவம் = பாடற்ச்சொல் + ' (' + பாடலெண்வரியெண்.replace('பாடல்','').replace('-வரி',':') + சொல்லெண்சரம்.replace('சொல்','') + ')' #.replace('','')
				print(இறுதிவடிவம்)
				#time.sleep(2)
#	#சொல்சுத்தம்1 = சொல்.replace('[',"").replace(']','').replace("\n","").replace("\n',","")
#	#.replace("","").replace("'\n","").replace("'\n\t","").replace("n","").replace("\n',","")
#	print(சொல்)
#	with open('testSeparated.text','a') as resultFile:
#		சொல்சுத்தம்1 = சொல்.replace('[',"").replace(']','').replace("\n","").replace("\n',","")
#		resultFile.write(சொல்சுத்தம்1+'\n')
#       
      
